SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DN/RTL8720DN.cpp
/* RTL8720DN Example
 * Copyright (c) 2015 ARM Limited
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#if DEVICE_SPI && DEVICE_INTERRUPTIN && defined(MBED_CONF_EVENTS_PRESENT) && defined(MBED_CONF_NSAPI_PRESENT) && defined(MBED_CONF_RTOS_API_PRESENT)
#ifndef __STDC_FORMAT_MACROS
#define __STDC_FORMAT_MACROS
#endif
#include <inttypes.h>

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "RTL8720DN.h"
#include "features/netsocket/nsapi_types.h"
#include "mbed_trace.h"
#include "PinNames.h"
#include "platform/Callback.h"
#include "platform/mbed_error.h"
#include "rtos/Kernel.h"

#define TRACE_GROUP  "RTLA" // RTL8720DN AT layer

#define RTL8720DN_ALL_SOCKET_IDS      -1

#define RTL8720DN_DEFAULT_SPI_FREQUENCY 1000000


using namespace mbed;
using namespace std::chrono;
using std::milli;

RTL8720DN::RTL8720DN(PinName mosi, PinName miso, PinName sclk, PinName cs, PinName sync, PinName enable, bool debug)
    : _sdk_v(-1, -1, -1),
      _at_v(-1, -1, -1),
      _tcp_passive(false),
      _callback(),
      _spi(mosi, miso, sclk),
      _parser(mosi, miso, sclk, cs, sync, enable),
      _packets(0),
      _packets_end(&_packets),
      _sock_active_id(-1),
      _heap_usage(0),
      _connect_error(0),
      _disconnect(false),
      _fail(false),
      _sock_already(false),
      _closed(false),
      _error(false),
      _busy(false),
      _reset_done(false),
      _sock_sending_id(-1),
      _conn_status(NSAPI_STATUS_DISCONNECTED)
{
    _spi.frequency(RTL8720DN_DEFAULT_SPI_FREQUENCY);
    _parser.debug_on(debug);
    _parser.set_delimiter("\r\n");
    _parser.oob("+IPD", callback(this, &RTL8720DN::_oob_packet_hdlr));
    //Note: espressif at command document says that this should be +CWJAP_CUR:<error code>
    //but seems that at least current version is not sending it
    //https://www.espressif.com/sites/default/files/documentation/4a-esp8266_at_instruction_set_en.pdf
    //Also seems that ERROR is not sent, but FAIL instead
    _parser.oob("0,CLOSED", callback(this, &RTL8720DN::_oob_socket0_closed));
    _parser.oob("1,CLOSED", callback(this, &RTL8720DN::_oob_socket1_closed));
    _parser.oob("2,CLOSED", callback(this, &RTL8720DN::_oob_socket2_closed));
    _parser.oob("3,CLOSED", callback(this, &RTL8720DN::_oob_socket3_closed));
    _parser.oob("4,CLOSED", callback(this, &RTL8720DN::_oob_socket4_closed));
    //_parser.oob("+CWJAP:", callback(this, &RTL8720DN::_oob_connect_err));
    _parser.oob("WIFI ", callback(this, &RTL8720DN::_oob_connection_status));
    _parser.oob("UNLINK", callback(this, &RTL8720DN::_oob_socket_close_err));
    _parser.oob("ALREADY CONNECTED", callback(this, &RTL8720DN::_oob_conn_already));
    _parser.oob("ERROR", callback(this, &RTL8720DN::_oob_err));
    _parser.oob("ready", callback(this, &RTL8720DN::_oob_ready));
    _parser.oob("+CWLAP:", callback(this, &RTL8720DN::_oob_scan_results));
    // Don't expect to find anything about the watchdog reset in official documentation
    //https://techtutorialsx.com/2017/01/21/esp8266-watchdog-functions/
    _parser.oob("wdt reset", callback(this, &RTL8720DN::_oob_watchdog_reset));
    // Don't see a reason to make distiction between software(Software WDT reset) and hardware(wdt reset) watchdog treatment
    //https://github.com/esp8266/Arduino/blob/4897e0006b5b0123a2fa31f67b14a3fff65ce561/doc/faq/a02-my-esp-crashes.md#watchdog
    _parser.oob("Soft WDT reset", callback(this, &RTL8720DN::_oob_watchdog_reset));
    _parser.oob("busy ", callback(this, &RTL8720DN::_oob_busy));
    // NOTE: documentation v3.0 says '+CIPRECVDATA:<data_len>,' but it's not how the FW responds...
    _parser.oob("+CIPRECVDATA,", callback(this, &RTL8720DN::_oob_tcp_data_hdlr));
    // Register 'SEND OK'/'SEND FAIL' oobs here. Don't get involved in oob management with send status
    // because RTL8720DN modem possibly doesn't reply these packets on error case.
    _parser.oob("SEND OK", callback(this, &RTL8720DN::_oob_send_ok_received));
    _parser.oob("SEND FAIL", callback(this, &RTL8720DN::_oob_send_fail_received));

    for (int i = 0; i < SOCKET_COUNT; i++) {
        _sock_i[i].open = false;
        _sock_i[i].proto = NSAPI_UDP;
        _sock_i[i].tcp_data = NULL;
        _sock_i[i].tcp_data_avbl = 0;
        _sock_i[i].tcp_data_rcvd = 0;
        _sock_i[i].send_fail = false;
    }

    _scan_r.res = NULL;
    _scan_r.limit = 0;
    _scan_r.cnt = 0;
}

bool RTL8720DN::at_available()
{
    bool ready = false;

    _smutex.lock();
    // Might take a while to respond after HW reset
    for (int i = 0; i < 5; i++) {
        ready = _parser.send("AT")
                && _parser.recv("OK\n");
        if (ready) {
            break;
        }
        tr_debug("at_available(): Waiting AT response.");
    }
    // Switch spi-frequency from default one to assigned one
    if (MBED_CONF_RTL8720DN_SPI_FREQUENCY != RTL8720DN_DEFAULT_SPI_FREQUENCY) {
        _spi.frequency(MBED_CONF_RTL8720DN_SPI_FREQUENCY);
        ready &= _parser.send("AT")
                 && _parser.recv("OK\n");
    }
    _smutex.unlock();

    return ready;
}

bool RTL8720DN::echo_off()
{
    _smutex.lock();
    bool ready = _parser.send("ATE0")
                 && _parser.recv("OK\n");
    _smutex.unlock();

    return ready;
}

struct RTL8720DN::fw_sdk_version RTL8720DN::sdk_version()
{
    int major;
    int minor;
    int patch;
    char p;

