SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DN/RTL8720DN.cpp
    _smutex.lock();
    bool done = _parser.send("AT+GMR")
                //&& _parser.recv("SDK version:%d.%d.%d", &major, &minor, &patch)
                && _parser.recv("SDK version:v%d.%d%c", &major, &minor, &p)
                && _parser.recv("OK\n");
    _smutex.unlock();

    if (done) {
        _sdk_v.major = major;
        _sdk_v.minor = minor;
        //_sdk_v.patch = patch;
        _sdk_v.patch = 0;
    }
    return _sdk_v;
}

struct RTL8720DN::fw_at_version RTL8720DN::at_version()
{
    int major;
    int minor;
    int patch;
    int nused;

    _smutex.lock();
    bool done = _parser.send("AT+GMR")
                && _parser.recv("AT version:%d.%d.%d.%d", &major, &minor, &patch, &nused)
                && _parser.recv("OK\n");
    _smutex.unlock();

    if (done) {
        _at_v.major = major;
        _at_v.minor = minor;
        _at_v.patch = patch;
    }
    return _at_v;
}

bool RTL8720DN::startup(int mode)
{
    if (!(mode == WIFIMODE_STATION || mode == WIFIMODE_SOFTAP
            || mode == WIFIMODE_STATION_SOFTAP)) {
        return false;
    }

    _smutex.lock();
    set_timeout(RTL8720DN_CONNECT_TIMEOUT);
    bool done = _parser.send("AT+CWMODE=%d", mode)
                && _parser.recv("OK\n");
#if 0
                && _parser.send("AT+CIPMUX=1")
                && _parser.recv("OK\n");
#endif
    set_timeout(); //Restore default
    _smutex.unlock();

    return done;
}

bool RTL8720DN::reset(void)
{
    static const auto RTL8720DN_BOOTTIME = 10s;
    bool done = false;
return true;
    _smutex.lock();

    auto start_time = rtos::Kernel::Clock::now();
    _reset_done = false;
    set_timeout(RTL8720DN_RECV_TIMEOUT);
    for (int i = 0; i < 2; i++) {
        if (!_parser.send("AT+RST") || !_parser.recv("OK\n")) {
            tr_debug("reset(): AT+RST failed or no response.");
            continue;
        }

        while (!_reset_done) {
            _process_oob(RTL8720DN_RECV_TIMEOUT, true); // UART mutex claimed -> need to check for OOBs ourselves
            if (_reset_done || rtos::Kernel::Clock::now() - start_time >= RTL8720DN_BOOTTIME) {
                break;
            }
            rtos::ThisThread::sleep_for(100ms);
        }

        done = _reset_done;
        if (done) {
            break;
        }
    }

    tr_debug("reset(): Done: %s.", done ? "OK" : "FAIL");

    _clear_socket_packets(RTL8720DN_ALL_SOCKET_IDS);
    _sock_sending_id = -1;
    set_timeout();
    _smutex.unlock();

    return done;
}

bool RTL8720DN::dhcp(bool enabled, int mode)
{
    //only 3 valid modes
    if (mode < 0 || mode > 2) {
        return false;
    }

    _smutex.lock();
    bool done = _parser.send("AT+CWDHCP=%d,%d", enabled ? 1 : 0, mode)
                && _parser.recv("OK\n");
    _smutex.unlock();

    return done;
}

bool RTL8720DN::cond_enable_tcp_passive_mode()
{
    return true;
    bool done = true;

    if (FW_AT_LEAST_VERSION(_at_v.major, _at_v.minor, _at_v.patch, 0, RTL8720DN_AT_VERSION_TCP_PASSIVE_MODE)) {
        _smutex.lock();
        done = _parser.send("AT+CIPRECVMODE=1")
               && _parser.recv("OK\n");
        _smutex.unlock();

        _tcp_passive = done ? true : false;
    }

    return done;
}


nsapi_error_t RTL8720DN::connect(const char *ap, const char *passPhrase)
{
    nsapi_error_t ret = NSAPI_ERROR_OK;

    _smutex.lock();
    set_timeout(RTL8720DN_CONNECT_TIMEOUT);

    bool res = _parser.send("AT+CWJAP=\"%s\",\"%s\"", ap, passPhrase);
    if (res == true) {
        res = _parser.recv("OK\n");
        if (!res && _conn_status == NSAPI_STATUS_CONNECTING) {
            ret = NSAPI_ERROR_DHCP_FAILURE;
        }
    }
    if (!res) {
    //if (!res || !_parser.recv("OK\n")) {
        if (_fail) {
            if (_connect_error == 1) {
                ret = NSAPI_ERROR_CONNECTION_TIMEOUT;
            } else if (_connect_error == 2) {
                ret = NSAPI_ERROR_AUTH_FAILURE;
            } else if (_connect_error == 3) {
                ret = NSAPI_ERROR_NO_SSID;
            } else {
                ret = NSAPI_ERROR_NO_CONNECTION;
            }
            _fail = false;
            _connect_error = 0;
        }
    }

    set_timeout();
    _smutex.unlock();

    return ret;
}

bool RTL8720DN::disconnect(void)
{
    _smutex.lock();
    _disconnect = true;
    bool done = _parser.send("AT+CWQAP") && _parser.recv("OK\n");
    _smutex.unlock();

    return done;
}

bool RTL8720DN::ip_info_print(int enable)
{
    return true;
    _smutex.lock();
    _disconnect = true;
    bool done = _parser.send("AT+CIPDINFO=%d", enable) && _parser.recv("OK\n");
    _smutex.unlock();

    return done;
}


const char *RTL8720DN::ip_addr(void)
{
    _smutex.lock();
    set_timeout(RTL8720DN_CONNECT_TIMEOUT);
    if (!(_parser.send("AT+CIPSTA?")
            && _parser.recv("+CIPSTA:ip:\"%15[^\"]\"", _ip_buffer)
            && _parser.recv("OK\n"))) {
        _smutex.unlock();
        return 0;
    }
    set_timeout();
    _smutex.unlock();

    return _ip_buffer;
}

bool RTL8720DN::set_ip_addr(const char *ip, const char *gateway, const char *netmask)
{
    if (ip == nullptr || ip[0] == '\0') {
        return false;
    }

    bool ok = false;
    bool parser_send = false;

    _smutex.lock();

    if ((gateway == nullptr) || (netmask == nullptr) || gateway[0] == '\0' || netmask[0] == '\0') {
        parser_send = _parser.send("AT+CIPSTA_CUR=\"%s\"", ip);
    } else {
        parser_send = _parser.send("AT+CIPSTA_CUR=\"%s\",\"%s\",\"%s\"", ip, gateway, netmask);
    }

    if (parser_send  && _parser.recv("OK\n")) {
        ok = true;
    } else {
        ok = false;
    }
    _smutex.unlock();
    return ok;
}

const char *RTL8720DN::mac_addr(void)
{
    _smutex.lock();
    if (!(_parser.send("AT+CIPSTAMAC?")
            && _parser.recv("+CIPSTAMAC:\"%17[^\"]\"", _mac_buffer)
            && _parser.recv("OK\n"))) {
        _smutex.unlock();
        return 0;
    }
    _smutex.unlock();

    return _mac_buffer;
}

const char *RTL8720DN::gateway()
{
    _smutex.lock();
    if (!(_parser.send("AT+CIPSTA?")
            && _parser.recv("+CIPSTA:gateway:\"%15[^\"]\"", _gateway_buffer)
            && _parser.recv("OK\n"))) {
        _smutex.unlock();
        return 0;
    }
    _smutex.unlock();

    return _gateway_buffer;
}

const char *RTL8720DN::netmask()
{
    _smutex.lock();
    if (!(_parser.send("AT+CIPSTA?")
            && _parser.recv("+CIPSTA:netmask:\"%15[^\"]\"", _netmask_buffer)
            && _parser.recv("OK\n"))) {
        _smutex.unlock();
        return 0;
    }
    _smutex.unlock();

    return _netmask_buffer;
}

int8_t RTL8720DN::rssi()
{
    int8_t rssi = 0;
    char bssid[18];

