SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DN/RTL8720DN.cpp
    _smutex.lock();
    set_timeout(RTL8720DN_CONNECT_TIMEOUT);

    if (!(_parser.send("AT+CWJAP?")
            && _parser.recv("+CWJAP:\"%*[^\"]\",\"%17[^\"]\",", bssid)
            && _parser.recv("OK\n"))) {
        _smutex.unlock();
        return 0;
    }

    set_timeout();
    _smutex.unlock();

    WiFiAccessPoint ap[1];
    _scan_r.res = ap;
    _scan_r.limit = 1;
    _scan_r.cnt = 0;

    _smutex.lock();
    set_timeout(RTL8720DN_CONNECT_TIMEOUT);
    if (!(_parser.send("AT+CWLAP=\"\",\"%s\",", bssid)
            && _parser.recv("OK\n"))) {
        rssi = 0;
    } else if (_scan_r.cnt == 1) {
        //All OK so read and return rssi
        rssi = ap[0].get_rssi();
    }

    _scan_r.cnt = 0;
    _scan_r.res = NULL;
    set_timeout();
    _smutex.unlock();

    return rssi;
}

int RTL8720DN::scan(WiFiAccessPoint *res, unsigned limit, scan_mode mode, duration<unsigned, milli> t_max, duration<unsigned, milli> t_min)
{
    _smutex.lock();

    // Default timeout plus time spend scanning each channel
    set_timeout(RTL8720DN_MISC_TIMEOUT + 13 * (t_max != t_max.zero() ? t_max : duration<unsigned, milli>(RTL8720DN_SCAN_TIME_MAX_DEFAULT)));

    _scan_r.res = res;
    _scan_r.limit = limit;
    _scan_r.cnt = 0;

    bool ret_parse_send = true;

#if 0
    if (FW_AT_LEAST_VERSION(_at_v.major, _at_v.minor, _at_v.patch, 0, RTL8720DN_AT_VERSION_WIFI_SCAN_CHANGE)) {
        ret_parse_send = _parser.send("AT+CWLAP=,,,%u,%u,%u", (mode == SCANMODE_ACTIVE ? 0 : 1), t_min.count(), t_max.count());
    } else {
        ret_parse_send = _parser.send("AT+CWLAP");
    }
#endif
    ret_parse_send = _parser.send("AT+CWLAP");
    //rtos::ThisThread::sleep_for(100ms);

    if (!(ret_parse_send && _parser.recv("OK\n"))) {
        tr_warning("scan(): AP info parsing aborted.");
        // Lets be happy about partial success and not return NSAPI_ERROR_DEVICE_ERROR
        if (!_scan_r.cnt) {
            _scan_r.cnt = NSAPI_ERROR_DEVICE_ERROR;
        }
    }


    int cnt = _scan_r.cnt;
    _scan_r.res = NULL;

    set_timeout();
    _smutex.unlock();

    return cnt;
}

nsapi_error_t RTL8720DN::open_udp(int id, const char *addr, int port, int local_port, int udp_mode)
{
    static const char *type = "UDP";
    bool done = false;

    ip_info_print(1);

    _smutex.lock();

    // process OOB so that _sock_i reflects the correct state of the socket
    //_process_oob(RTL8720DN_SEND_TIMEOUT, true);

    // Previous close() can fail with busy in sending. Usually, user will ignore the close()
    // error code and cause 'spurious close', in which case user has closed the socket but RTL8720DN modem
    // hasn't yet. Because we don't know how long RTL8720DN modem will trap in busy, enlarge retry count
    // or timeout in close() isn't a nice way. Here, we actively re-call close() in open() to let the modem
    // close the socket. User can re-try open() on failure. Without this active close(), open() can fail forever
    // with previous 'spurious close', unless peer closes the socket and so RTL8720DN modem closes it accordingly.
    if (id >= SOCKET_COUNT) {
        _smutex.unlock();
        return NSAPI_ERROR_PARAMETER;
    } else if (_sock_i[id].open) {
        close(id);
    }

    for (int i = 0; i < 2; i++) {
        if (local_port) {
            done = _parser.send("AT+CIPSTART=%d,\"%s\",\"%s\",%d,%d,%d", id, type, addr, port, local_port, udp_mode);
        } else {
            done = _parser.send("AT+CIPSTART=%d,\"%s\",\"%s\",%d", id, type, addr, port);
        }

        if (done) {
            if (!_parser.recv("OK\n")) {
                if (_sock_already) {
                    _sock_already = false; // To be raised again by OOB msg
                    done = close(id);
                    if (!done) {
                        break;
                    }
                }
                if (_error) {
                    _error = false;
                    done = false;
                }
                continue;
            }
            _sock_i[id].open = true;
            _sock_i[id].proto = NSAPI_UDP;
            break;
        }
    }
    _clear_socket_packets(id);

    _smutex.unlock();

    tr_debug("open_udp(): UDP socket %d opened: %s.", id, (_sock_i[id].open ? "true" : "false"));

    return done ? NSAPI_ERROR_OK : NSAPI_ERROR_DEVICE_ERROR;
}

nsapi_error_t RTL8720DN::open_tcp(int id, const char *addr, int port, int keepalive)
{
    static const char *type = "TCP";
    bool done = false;

    ip_info_print(1);

    if (!addr) {
        return NSAPI_ERROR_PARAMETER;
    }
    _smutex.lock();

    // process OOB so that _sock_i reflects the correct state of the socket
    //_process_oob(RTL8720DN_SEND_TIMEOUT, true);

    // See the reason above with close()
    if (id >= SOCKET_COUNT) {
        _smutex.unlock();
        return NSAPI_ERROR_PARAMETER;
    } else if (_sock_i[id].open) {
        close(id);
    }

    for (int i = 0; i < 2; i++) {
        if (keepalive) {
            done = _parser.send("AT+CIPSTART=%d,\"%s\",\"%s\",%d,%d", id, type, addr, port, keepalive);
        } else {
            done = _parser.send("AT+CIPSTART=%d,\"%s\",\"%s\",%d", id, type, addr, port);
        }

        if (done) {
            if (!_parser.recv("OK\n")) {
                if (_sock_already) {
                    _sock_already = false; // To be raised again by OOB msg
                    done = close(id);
                    if (!done) {
                        break;
                    }
                }
                if (_error) {
                    _error = false;
                    done = false;
                }
                continue;
            }
            _sock_i[id].open = true;
            _sock_i[id].proto = NSAPI_TCP;
            break;
        }
    }
    _clear_socket_packets(id);

    _smutex.unlock();

    tr_debug("open_tcp: TCP socket %d opened: %s . ", id, (_sock_i[id].open ? "true" : "false"));

