SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DN/RTL8720DN.cpp
    return done ? NSAPI_ERROR_OK : NSAPI_ERROR_DEVICE_ERROR;
}

bool RTL8720DN::dns_lookup(const char *name, char *ip)
{
    _smutex.lock();
    set_timeout(RTL8720DN_DNS_TIMEOUT);
    bool done = _parser.send("AT+CIPDOMAIN=\"%s\"", name)
                && _parser.recv("+CIPDOMAIN:%15[^\n]\n", ip)
                && _parser.recv("OK\n");
    set_timeout();
    _smutex.unlock();

    return done;
}

nsapi_size_or_error_t RTL8720DN::send(int id, const void *data, uint32_t amount)
{
    if (_sock_i[id].proto == NSAPI_TCP) {
        if (_sock_sending_id >= 0 && _sock_sending_id < SOCKET_COUNT) {
            if (!_sock_i[id].send_fail) {
                tr_debug("send(): Previous packet (socket %d) was not yet ACK-ed with SEND OK.", _sock_sending_id);
                return NSAPI_ERROR_WOULD_BLOCK;
            } else {
                tr_debug("send(): Previous packet (socket %d) failed.", id);
                return NSAPI_ERROR_DEVICE_ERROR;
            }
        }
    }

    nsapi_error_t ret = NSAPI_ERROR_DEVICE_ERROR;
    int bytes_confirmed = 0;

    // +CIPSEND supports up to 2048 bytes at a time
    // Data stream can be truncated
    if (amount > 2048 && _sock_i[id].proto == NSAPI_TCP) {
        amount = 2048;
        // Datagram must stay intact
    } else if (amount > 2048 && _sock_i[id].proto == NSAPI_UDP) {
        tr_debug("send(): UDP datagram maximum size is 2048 .");
        return NSAPI_ERROR_PARAMETER;
    }

    _smutex.lock();
    // Mark this socket is sending. We allow only one actively sending socket because:
    // 1. RTL8720DN AT packets 'SEND OK'/'SEND FAIL' are not associated with socket ID. No way to tell them.
    // 2. In original implementation, RTL8720DN::send() is synchronous, which implies only one actively sending socket.
    _sock_sending_id = id;
    set_timeout(RTL8720DN_SEND_TIMEOUT);
    _busy = false;
    _error = false;
    if (!_parser.send("AT+CIPSEND=%d,%" PRIu32, id, amount)) {
        tr_debug("send(): AT+CIPSEND failed.");
        goto END;
    }

    if (!_parser.recv(">")) {
        // This means RTL8720DN hasn't even started to receive data
        tr_debug("send(): Didn't get \">\"");
        if (_sock_i[id].proto == NSAPI_TCP) {
            ret = NSAPI_ERROR_WOULD_BLOCK; // Not necessarily critical error.
        } else if (_sock_i[id].proto == NSAPI_UDP) {
            ret = NSAPI_ERROR_NO_MEMORY;
        }
        goto END;
    }

    if (_parser.write((char *)data, (int)amount) < 0) {
        tr_debug("send(): Failed to write serial data");
        // Serial is not working, serious error, reset needed.
        ret = NSAPI_ERROR_DEVICE_ERROR;
        goto END;
    }
    ret = amount;

#if 0
    // The "Recv X bytes" is not documented.
    if (!_parser.recv("Recv %d bytes", &bytes_confirmed)) {
        tr_debug("send(): Bytes not confirmed.");
        if (_sock_i[id].proto == NSAPI_TCP) {
            ret = NSAPI_ERROR_WOULD_BLOCK;
        } else if (_sock_i[id].proto == NSAPI_UDP) {
            ret = NSAPI_ERROR_NO_MEMORY;
        }
    } else if (bytes_confirmed != (int)amount && _sock_i[id].proto == NSAPI_UDP) {
        tr_debug("send(): Error: confirmed %d bytes, but expected %d.", bytes_confirmed, amount);
        ret = NSAPI_ERROR_DEVICE_ERROR;
    } else {
        // TCP can accept partial writes (if they ever happen)
        ret = bytes_confirmed;
    }
#endif

END:
    _process_oob(RTL8720DN_RECV_TIMEOUT, true); // Drain USART receive register to avoid data overrun

    // error hierarchy, from low to high
    // NOTE: We cannot return NSAPI_ERROR_WOULD_BLOCK when "Recv X bytes" has reached, otherwise duplicate data send.
    if (_busy && ret < 0) {
        ret = NSAPI_ERROR_WOULD_BLOCK;
        tr_debug("send(): Modem busy.");
    }

    if (_error) {
        // FIXME: Not sure clear or not of _error. See it as device error and it can recover only via reset?
        _sock_sending_id = -1;
        ret = NSAPI_ERROR_CONNECTION_LOST;
        tr_debug("send(): Connection disrupted.");
    }

    if (_sock_i[id].send_fail) {
        _sock_sending_id = -1;
        if (_sock_i[id].proto == NSAPI_TCP) {
            ret = NSAPI_ERROR_DEVICE_ERROR;
        } else {
            ret = NSAPI_ERROR_NO_MEMORY;
        }
        tr_debug("send(): SEND FAIL received.");
    }

    if (!_sock_i[id].open && ret < 0) {
        _sock_sending_id = -1;
        ret = NSAPI_ERROR_CONNECTION_LOST;
        tr_debug("send(): Socket %d closed abruptly.", id);
    }

    set_timeout();
    _smutex.unlock();

    return ret;
}

void RTL8720DN::_oob_packet_hdlr()
{
    int id;
    int port;
    int amount;
    int pdu_len;

    // Get socket id
    if (!_parser.scanf(",%d,", &id)) {
        return;
    }

    if (_tcp_passive && _sock_i[id].open == true && _sock_i[id].proto == NSAPI_TCP) {
        //For TCP +IPD return only id and amount and it is independent on AT+CIPDINFO settings
        //Unfortunately no information about that in ESP manual but it has sense.
        if (_parser.recv("%d\n", &amount)) {
            _sock_i[id].tcp_data_avbl = amount;

            // notify data is available
            if (_callback) {
                _callback();
            }
        }
        return;
    } else {
        char rbuf[64];
        char *rbufp = rbuf;
        if (!(_parser.scanf("%63[^:]:", rbuf))) {
            return;
        }
        std::sscanf(rbufp, "%d,", &amount);
        rbufp = strchr(rbufp, ',') + 1;
        _ip_buffer[0] = '\0';
        std::sscanf(rbufp, "%15[0123456789.],", _ip_buffer);
        rbufp = strchr(rbufp, ',') + 1;
        std::sscanf(rbufp, "%d", &port);
    }

    pdu_len = sizeof(struct packet) + amount;

    if ((_heap_usage + pdu_len) > MBED_CONF_RTL8720DN_SOCKET_BUFSIZE) {
        tr_debug("\"esp8266.socket-bufsize\"-limit exceeded, packet dropped");
        return;
    }

    struct packet *packet = (struct packet *)malloc(pdu_len);
    if (!packet) {
        tr_debug("_oob_packet_hdlr(): Out of memory, unable to allocate memory for packet.");
        return;
    }
    _heap_usage += pdu_len;

