SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DN/RTL8720DN.cpp
void RTL8720DN::set_timeout(duration<uint32_t, milli> timeout)
{
    _parser.set_timeout(timeout.count());
}

bool RTL8720DN::readable()
{
#if 0
    return _spi.FileHandle::readable();
#endif
    return true;
}

bool RTL8720DN::writeable()
{
#if 0
    return _spi.FileHandle::writable();
#endif
    return true;
}

#if 0
void RTL8720DN::sigio(Callback<void()> func)
{
    _spi.sigio(func);
    _callback = func;
}
#endif

void RTL8720DN::attach(Callback<void()> status_cb)
{
    _conn_stat_cb = status_cb;
}

bool RTL8720DN::set_sntp_config(bool enable, int timezone, const char *server0,
                              const char *server1, const char *server2)
{
    bool done = false;
    _smutex.lock();
    if ((server0 == nullptr || server0[0] == '\0')) {
        done = _parser.send("AT+CIPSNTPCFG=%d,%d",
                            enable ? 1 : 0, timezone);
    } else if ((server0 != nullptr || server0[0] != '\0')
               && (server1 == nullptr && server1[0] == '\0')) {
        done = _parser.send("AT+CIPSNTPCFG=%d,%d,%s",
                            enable ? 1 : 0, timezone, server0);
    } else if ((server0 != nullptr || server0[0] != '\0')
               && (server1 != nullptr && server1[0] != '\0')
               && (server2 == nullptr && server2[0] == '\0')) {
        done = _parser.send("AT+CIPSNTPCFG=%d,%d,%s,%s",
                            enable ? 1 : 0, timezone, server0, server1);
    } else {
        done = _parser.send("AT+CIPSNTPCFG=%d,%d,%s,%s,%s",
                            enable ? 1 : 0, timezone, server0, server1, server2);
    }
    done &= _parser.recv("OK\n");
    _smutex.unlock();
    return done;
}

bool RTL8720DN::get_sntp_config(bool *enable, int *timezone, char *server0,
                              char *server1, char *server2)
{
    _smutex.lock();
    unsigned int tmp;
    bool done = _parser.send("AT+CIPSNTPCFG?")
                && _parser.scanf("+CIPSNTPCFG:%d,%d,\"%32[^\"]\",\"%32[^\"]\",\"%32[^\"]\"",
                                 &tmp, timezone, server0, server1, server2)
                && _parser.recv("OK\n");
    _smutex.unlock();
    *enable = tmp ? true : false;
    return done;
}

bool RTL8720DN::get_sntp_time(std::tm *t)
{
    _smutex.lock();
    char buf[25]; // Thu Aug 04 14:48:05 2016 (always 24 chars + \0)
    memset(buf, 0, 25);

    bool done = _parser.send("AT+CIPSNTPTIME?")
                && _parser.scanf("+CIPSNTPTIME:%24c", buf)
                && _parser.recv("OK\n");
    _smutex.unlock();

    if (!done) {
        return false;
    }

    char wday[4] = "\0", mon[4] = "\0";
    int mday = 0, hour = 0, min = 0, sec = 0, year = 0;
    int ret = sscanf(buf, "%s %s %d %d:%d:%d %d",
                     wday, mon, &mday, &hour, &min, &sec, &year);
    if (ret != 7) {
        tr_debug("get_sntp_time(): sscanf returned %d", ret);
        return false;
    }

    t->tm_sec = sec;
    t->tm_min = min;
    t->tm_hour = hour;
    t->tm_mday = mday;

    t->tm_wday = 0;
    if (strcmp(wday, "Mon") == 0) {
        t->tm_wday = 0;
    } else if (strcmp(wday, "Tue") == 0) {
        t->tm_wday = 1;
    } else if (strcmp(wday, "Wed") == 0) {
        t->tm_wday = 2;
    } else if (strcmp(wday, "Thu") == 0) {
        t->tm_wday = 3;
    } else if (strcmp(wday, "Fri") == 0) {
        t->tm_wday = 4;
    } else if (strcmp(wday, "Sat") == 0) {
        t->tm_wday = 5;
    } else if (strcmp(wday, "Sun") == 0) {
        t->tm_wday = 6;
    } else {
        tr_debug("get_sntp_time(): Invalid weekday: %s", wday);
        return false;
    }

    t->tm_mon = 0;
    if (strcmp(mon, "Jan") == 0) {
        t->tm_mon = 0;
    } else if (strcmp(mon, "Feb") == 0) {
        t->tm_mon = 1;
    } else if (strcmp(mon, "Mar") == 0) {
        t->tm_mon = 2;
    } else if (strcmp(mon, "Apr") == 0) {
        t->tm_mon = 3;
    } else if (strcmp(mon, "May") == 0) {
        t->tm_mon = 4;
    } else if (strcmp(mon, "Jun") == 0) {
        t->tm_mon = 5;
    } else if (strcmp(mon, "Jul") == 0) {
        t->tm_mon = 6;
    } else if (strcmp(mon, "Aug") == 0) {
        t->tm_mon = 7;
    } else if (strcmp(mon, "Sep") == 0) {
        t->tm_mon = 8;
    } else if (strcmp(mon, "Oct") == 0) {
        t->tm_mon = 9;
    } else if (strcmp(mon, "Nov") == 0) {
        t->tm_mon = 10;
    } else if (strcmp(mon, "Dec") == 0) {
        t->tm_mon = 11;
    } else {
        tr_debug("get_sntp_time(): Invalid month: %s", mon);
        return false;
    }

    t->tm_year = (year - 1900);

    return true;
}

bool RTL8720DN::_recv_ap(nsapi_wifi_ap_t *ap)
{
    int sec = NSAPI_SECURITY_UNKNOWN;
    int dummy;
    int ret;

        //ret = _parser.scanf("(%d,\"%32[^\"]\",%hhd,\"%hhx:%hhx:%hhx:%hhx:%hhx:%hhx\",%hhu)\n",
        ret = _parser.scanf("(%d,\"%32[^\"]\",%hhd,\"%hhx:%hhx:%hhx:%hhx:%hhx:%hhx\",%hhu)\n",
                            &sec,
                            ap->ssid,
                            &ap->rssi,
                            &ap->bssid[0], &ap->bssid[1], &ap->bssid[2], &ap->bssid[3], &ap->bssid[4], &ap->bssid[5],
                            &ap->channel);

    if (ret < 0) {
        _parser.abort();
        tr_warning("_recv_ap(): AP info missing.");
    }

    ap->security = sec < 5 ? (nsapi_security_t)sec : NSAPI_SECURITY_UNKNOWN;

    return ret < 0 ? false : true;
}

void RTL8720DN::_oob_watchdog_reset()
{
    MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_CODE_ETIME), \
               "_oob_watchdog_reset() modem watchdog reset triggered\n");
}

void RTL8720DN::_oob_ready()
{
    _reset_done = true;

    for (int i = 0; i < SOCKET_COUNT; i++) {
        _sock_i[i].open = false;
    }

    // Makes possible to reinitialize
    _conn_status = NSAPI_STATUS_ERROR_UNSUPPORTED;
    _conn_stat_cb();

    tr_debug("_oob_reset(): Reset detected.");
}

void RTL8720DN::_oob_busy()
{
    char status;
    if (_parser.scanf("%c...\n", &status)) {
        if (status == 's') {
            tr_debug("_oob_busy(): Busy s...");
        } else if (status == 'p') {
            tr_debug("_oob_busy(): Busy p...");
        } else {
            tr_error("_oob_busy(): unrecognized busy state '%c...'", status);
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_CODE_EBADMSG), \
                       "RTL8720DN::_oob_busy() unrecognized busy state\n");
        }
    } else {
        MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_CODE_ENOMSG), \
                   "RTL8720DN::_oob_busy() AT timeout\n");
    }
    _busy = true;
}

void RTL8720DN::_oob_tcp_data_hdlr()
{
    int32_t len;

    MBED_ASSERT(_sock_active_id >= 0 && _sock_active_id < 5);

    if (!_parser.scanf("%" SCNd32 ":", &len)) {
        return;
    }

    if (_parser.read(_sock_i[_sock_active_id].tcp_data, len) == -1) {
        return;
    }

