SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DN/RTL8720DN.cpp
    _sock_i[_sock_active_id].tcp_data_rcvd = len;
}

void RTL8720DN::_oob_scan_results()
{
    nsapi_wifi_ap_t ap;

    if (_recv_ap(&ap)) {
        if (_scan_r.res && _scan_r.cnt < _scan_r.limit) {
            _scan_r.res[_scan_r.cnt] = WiFiAccessPoint(ap);

            _scan_r.cnt++;
        }
    }
}

void RTL8720DN::_oob_connect_err()
{
    _fail = false;
    _connect_error = 0;

    if (_parser.scanf("%d", &_connect_error) && _parser.scanf("FAIL")) {
        _fail = true;
        _parser.abort();
    }
}


void RTL8720DN::_oob_conn_already()
{
    _sock_already = true;
    _parser.abort();
}

void RTL8720DN::_oob_err()
{
    _error = true;
    _parser.abort();
}

void RTL8720DN::_oob_socket_close_err()
{
    if (_error) {
        _error = false;
    }
    _closed = true; // Not possible to pinpoint to a certain socket
}

void RTL8720DN::_oob_socket0_closed()
{
    static const int id = 0;
    _sock_i[id].open = false;
    // Closed, so this socket escapes from SEND FAIL status
    _clear_socket_sending(id);
    tr_debug("_oob_socket0_closed(): Socket %d closed.", id);
}

void RTL8720DN::_oob_socket1_closed()
{
    static const int id = 1;
    _sock_i[id].open = false;
    // Closed, so this socket escapes from SEND FAIL status
    _clear_socket_sending(id);
    tr_debug("_oob_socket1_closed(): Socket %d closed.", id);
}

void RTL8720DN::_oob_socket2_closed()
{
    static const int id = 2;
    _sock_i[id].open = false;
    _clear_socket_sending(id);
    tr_debug("_oob_socket2_closed(): Socket %d closed.", id);
}

void RTL8720DN::_oob_socket3_closed()
{
    static const int id = 3;
    _sock_i[id].open = false;
    _clear_socket_sending(id);
    tr_debug("_oob_socket3_closed(): %d closed.", id);
}

void RTL8720DN::_oob_socket4_closed()
{
    static const int id = 4;
    _sock_i[id].open = false;
    // Closed, so this socket escapes from SEND FAIL status
    _clear_socket_sending(id);
    tr_debug("_oob_socket0_closed(): Socket %d closed.", id);
}

void RTL8720DN::_oob_connection_status()
{
    char status[13];
    if (_parser.recv("%12[^\"]\n", status)) {
        if (strcmp(status, "GOT IP\n") == 0) {
            _conn_status = NSAPI_STATUS_GLOBAL_UP;
        } else if (strcmp(status, "DISCONNECT\n") == 0) {
            if (_disconnect) {
                _conn_status = NSAPI_STATUS_DISCONNECTED;
                _disconnect = false;
            } else {
                _conn_status = NSAPI_STATUS_CONNECTING;
            }
        } else if (strcmp(status, "CONNECTED\n") == 0) {
            _conn_status = NSAPI_STATUS_CONNECTING;
        } else {
            tr_error("_oob_connection_status(): Invalid AT cmd \'%s\' .", status);
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_CODE_EBADMSG), \
                       "RTL8720DN::_oob_connection_status: invalid AT cmd\n");
        }
    } else {
        tr_error("_oob_connection_status(): Network status timeout, disconnecting.");
        if (!disconnect()) {
            tr_warning("_oob_connection_status(): Driver initiated disconnect failed.");
        } else {
            tr_debug("_oob_connection_status(): Disconnected.");
        }
        _conn_status = NSAPI_STATUS_ERROR_UNSUPPORTED;
    }

    MBED_ASSERT(_conn_stat_cb);
    _conn_stat_cb();
}

void RTL8720DN::_oob_send_ok_received()
{
    tr_debug("_oob_send_ok_received called for socket %d", _sock_sending_id);
    _sock_sending_id = -1;
}

void RTL8720DN::_oob_send_fail_received()
{
    tr_debug("_oob_send_fail_received called for socket %d", _sock_sending_id);
    if (_sock_sending_id >= 0 && _sock_sending_id < SOCKET_COUNT) {
        _sock_i[_sock_sending_id].send_fail = true;
    }
    _sock_sending_id = -1;
}

int8_t RTL8720DN::default_wifi_mode()
{
    int8_t mode;

    _smutex.lock();
    if (_parser.send("AT+CWMODE_DEF?")
            && _parser.recv("+CWMODE_DEF:%hhd", &mode)
            && _parser.recv("OK\n")) {
        _smutex.unlock();
        return mode;
    }
    _smutex.unlock();

    return 0;
}

void RTL8720DN::flush()
{
    _smutex.lock();
    _parser.flush();
    _smutex.unlock();
}

bool RTL8720DN::set_default_wifi_mode(const int8_t mode)
{
    return true;
    _smutex.lock();
    bool done = _parser.send("AT+CWMODE_DEF=%hhd", mode)
                && _parser.recv("OK\n");
    _smutex.unlock();

    return done;
}

nsapi_connection_status_t RTL8720DN::connection_status() const
{
    return _conn_status;
}

bool RTL8720DN::set_country_code_policy(bool track_ap, const char *country_code, int channel_start, int channels)
{
    return true;
    if (!(FW_AT_LEAST_VERSION(_at_v.major, _at_v.minor, _at_v.patch, 0, RTL8720DN_AT_VERSION_WIFI_SCAN_CHANGE))) {
        return true;
    }

    int t_ap = track_ap ? 0 : 1;

    _smutex.lock();
    bool done = _parser.send("AT+CWCOUNTRY=%d,\"%s\",%d,%d", t_ap, country_code, channel_start, channels)
                && _parser.recv("OK\n");

    if (!done) {
        tr_error("\"AT+CWCOUNTRY=%d,\"%s\",%d,%d\" - FAIL", t_ap, country_code, channel_start, channels);
    }
#if 0
    done &= _parser.send("AT+CWCOUNTRY_CUR=%d,\"%s\",%d,%d", t_ap, country_code, channel_start, channels)
            && _parser.recv("OK\n");

    if (!done) {
        tr_error("\"AT+CWCOUNTRY_CUR=%d,\"%s\",%d,%d\" - FAIL", t_ap, country_code, channel_start, channels);
    }
#endif
    _smutex.unlock();

    return done;
}

#endif
